add real time statistic
